request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://spring.io/guides/gs-producing-web-service">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:getCurrencyConvRequest>
            <gs:code>BRL</gs:code>
            <gs:op>0</gs:op>
            <gs:amount>150.00</gs:amount>
        </gs:getCurrencyConvRequest>
    </soapenv:Body>
</soapenv:Envelope>